АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/алк_ПеремещениеЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЛесопродукции</name>
  <comment>Перемещение лесопродукции (круглые ЛМ и пиломатериала штучно) по различным направлениям с указанием участка отправителя</comment>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыДокументовПеремещенияЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ГрафикСмен/алк_ГрафикСмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ГрафикСмен</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидыДокументовПеремещенияЛесопродукции/алк_ВидыДокументовПеремещенияЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДокументовПеремещенияЛесопродукции</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственныеНужды</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковкуСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаСторону</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаДГ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_МЛП</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПроизводства</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Остатки</name>
  </enumValues>
  <enumValues>
    <name>Произведено</name>
  </enumValues>
  <enumValues>
    <name>Подано</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
    <comment>Упаковано объема</comment>
  </enumValues>
  <enumValues>
    <name>Выход</name>
  </enumValues>
  <enumValues>
    <name>УпакованоШтук</name>
    <comment>Упаковано штук пакетов</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование1</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование2</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование3</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеНаКотельную</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырья</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЕль</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЛиственница</name>
  </enumValues>
  <enumValues>
    <name>КРСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>КРСОбщий</name>
  </enumValues>
  <enumValues>
    <name>ОстатокВСилосе</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяВсего</name>
  </enumValues>
  <enumValues>
    <name>ГранулированиеСреднее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКора</name>
  </enumValues>
  <enumValues>
    <name>ПоступилоНаБиржу</name>
    <comment>ВходящийТранспорт. Привезли еще не разгружался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСобственнымиСилами</name>
    <comment>ВходящийТранспортРазгрузили еще не сортировался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСиламиПодрядчика</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСырьяПослеДробления</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства) Экспорт 
		
		Если ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПриемкаС_ЦПШ Тогда
			СформироватьТаблицаПеремещениеЛесопродукции(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ВидДвиженияНакопления.Приход);
						
			////Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
			//Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаПеремещениеЛесопродукции.Дата) Тогда
			//	СформироватьТаблицаПроизводствоОборот(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства);
			//	СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства);
			//КонецЕсли;
		Иначе
			СформироватьТаблицаПеремещениеЛесопродукции(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ВидДвиженияНакопления.Расход);
		КонецЕсли; 
		
		//20250825 Данько ТА добавила дату перехода, так как старый механизм движений в данный момент работает некорректно (но при этом, чтобы не сломать старые движения)
		ПараметрНастройки = "ДатаПерехода_ПеремещенияЛесопродукции";          
		
		СтруктураНастроек = Новый Структура("Параметр", ПараметрНастройки);
		ПолучитьДатуВвода = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
		ДатаВвода = Дата("23001201");
		Если ПолучитьДатуВвода.Количество() > 0 Тогда
			ДатаВвода = ПолучитьДатуВвода[0].Дата;
		КонецЕсли;
		
		ЗаписыватьДвиженияПоСтаромуМеханизму = Истина;
		Если ДатаВвода <= ДокументСсылкаПеремещениеЛесопродукции.ДатаСмены Тогда
			ЗаписыватьДвиженияПоСтаромуМеханизму = Ложь;  
		КонецЕсли;  	
		
		ТолькоРасход = Ложь;
		Если ЗаписыватьДвиженияПоСтаромуМеханизму Тогда 
			Если ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ 
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦЛП 
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ВозратС_ЦПШ
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.Перемещение Тогда
				СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ДокументСсылкаПеремещениеЛесопродукции.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000003"));
				
			ИначеЕсли ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ВозратС_ЦЛП
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ВозратС_МЛП Тогда
				
				СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства);
				
			Иначе	
				СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, Истина);  		
			КонецЕсли;    
		Иначе 
			Если ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаВУтилизацию 
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаСобственныеНужды 
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.СписаниеНаЦЛП
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.РеализацияНаДГ
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаСГП
				ИЛИ ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.РеализацияНаСторону Тогда 
				ТолькоРасход = Истина;  		
			КонецЕсли; 
			СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ТолькоРасход);
		КонецЕсли;
		
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаПеремещениеЛесопродукции.Дата) Тогда 
			СформироватьТаблицаПроизводствоОборот(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства,ТолькоРасход); //20250825 Данько ТА ранее не было параметра ТолькоРасход, добавила, чтобы правильно писались движения; по старому механизму ничего не меняется, так как когда не было параметра, стояла ложь автоматом
		КонецЕсли; 
		//\\
		
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаПеремещениеЛесопродукции(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ВидДвижения)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Количество,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПриемкаС_ЦПШ)
		|			ТОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель
		|		ИНАЧЕ алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПриемкаС_ЦПШ)
		|			ТОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ЯчейкаПолучатель
		|		ИНАЧЕ алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ячейка
		|	КОНЕЦ КАК Ячейка,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаЦПШ)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаСобственныеНужды)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСобственные)
		|				ИНАЧЕ ВЫБОР
		|						КОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.РеализацияНаСторону)
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаРеализацию)
		|						ИНАЧЕ ВЫБОР
		|								КОГДА алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПриемкаС_ЦПШ)
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаРеализацию)
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Операция,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ДатаСмены,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Смена,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвижения);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПеремещениеЛесопродукции.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЛесопродукции);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		
		//Обороты производства Сергеева Г.О. ++ 
		СформироватьТаблицуОборотыПроизводства(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства);
		//Обороты производства Сергеева Г.О. --
		
		Если ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаПереупаковкуСГП 
			Или ДокументСсылкаПеремещениеЛесопродукции.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.Перемещение Тогда
			
			ДополнитьТаблицаЗапасыОрганизацииПоступлением(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства);
			
		КонецЕсли; 
		
		СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры // СформироватьТаблицаПеремещениеЛесопродукции
	
	Процедура ДополнитьТаблицаЗапасыОрганизацииПоступлением(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Количество,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем,
		|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
		|	&Период,
		|	&СтруктурнаяЕдиница,
		|	&Ячейка,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ДатаСмены,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Смена,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПеремещениеЛесопродукции.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЛесопродукции);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ДокументСсылкаПеремещениеЛесопродукции.СтруктурнаяЕдиницаПолучатель);
		Запрос.УстановитьПараметр("Ячейка", ДокументСсылкаПеремещениеЛесопродукции.ЯчейкаПолучатель);
		
		РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаЗапасыОрганизации") Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыОрганизации.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					
				КонецЦикла; 
				
			Иначе
				
				СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", РезультатЗапроса.Выгрузить());
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукции.Ссылка.Организация КАК Организация,
		|	&Период,
		|	алк_ПеремещениеЛесопродукции.Ссылка.ДатаСмены КАК ДатаСмены,
		|	алк_ПеремещениеЛесопродукции.Ссылка.Смена КАК Смена,
		|	0 КАК МоментПроведения,
		|	&Сотрудник
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции КАК алк_ПеремещениеЛесопродукции
		|ГДЕ
		|	алк_ПеремещениеЛесопродукции.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПеремещениеЛесопродукции.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЛесопродукции);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тРезультат = МассивРезультатов[0].Выгрузить();
		
		Для каждого стр Из тРезультат Цикл
			
			стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЦикла; 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослБиржа", тРезультат);
				
	КонецПроцедуры // СформироватьТаблицаДокументыПослБиржа
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ТолькоРасход = Ложь)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК Период,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ячейка КАК Штабель,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|	И (алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код = ""ПБ-00000002""
		|				И &ДатаНачалаУчетаЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаШпона
		|			ИЛИ алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код <> ""ПБ-00000002""
		|				И &ДатаНачалаУчетаПилматЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаПилмат)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ЯчейкаПолучатель,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|	И НЕ &ТолькоРасход
		|	И (алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код = ""ПБ-00000002""
		|				И &ДатаНачалаУчетаЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаШпона
		|			ИЛИ алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код <> ""ПБ-00000002""
		|				И &ДатаНачалаУчетаПилматЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаПилмат)";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЛесопродукции);
		Запрос.УстановитьПараметр("ТолькоРасход", ТолькоРасход);
		Запрос.УстановитьПараметр("ДатаНачалаУчетаЗаполнена", ЗначениеЗаполнено(Константы.алк_ДатаНачалаУчетаШпона.Получить()));
		Запрос.УстановитьПараметр("ДатаНачалаУчетаПилматЗаполнена", ЗначениеЗаполнено(Константы.алк_ДатаВремяНачалаВводаПоказателейЦЛПДГ.Получить()));
		Запрос.УстановитьПараметр("ДатаНачалаУчетаПилмат", Константы.алк_ДатаВремяНачалаВводаПоказателейЦЛПДГ.Получить());
		Запрос.УстановитьПараметр("ДатаНачалаУчетаШпона", Константы.алк_ДатаНачалаУчетаШпона.Получить());
	
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", РезультатЗапроса);
			
	КонецПроцедуры // СформироватьТаблицаОстаткиЗапасов
	
	Процедура СформироватьТаблицаПроизводствоОборот(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства, ТолькоРасход = Ложь)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукции.Дата КАК Период,
		|	алк_ГрафикСмен.Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
		|	алк_ПеремещениеЛесопродукции.ДатаСмены,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	ВЫБОР
		|		КОГДА &ТолькоРасход
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Списание)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеРасход)
		|	КОНЕЦ КАК Операция,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
		|	NULL КАК СерийныйНомер,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат,
		|	алк_ПеремещениеЛесопродукции.Смена,
		|	алк_ПеремещениеЛесопродукции.СтруктурнаяЕдиница КАК Склад,
		|	алк_ПеремещениеЛесопродукции.Участок,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем КАК Количество
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции КАК алк_ПеремещениеЛесопродукции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|		ПО алк_ПеремещениеЛесопродукции.Ссылка = алк_ПеремещениеЛесопродукцииЗапасы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрафикСмен КАК алк_ГрафикСмен
		|		ПО алк_ПеремещениеЛесопродукции.ДатаСмены = алк_ГрафикСмен.ДатаСмены
		|			И алк_ПеремещениеЛесопродукции.Смена = алк_ГрафикСмен.Смена
		|			И алк_ПеремещениеЛесопродукции.Участок = алк_ГрафикСмен.Участок
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|	И (алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код = ""ПБ-00000002""
		|				И &ДатаНачалаУчетаЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаШпона
		|			ИЛИ алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код <> ""ПБ-00000002""
		|				И &ДатаНачалаУчетаПилматЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаПилмат)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукции.Дата,
		|	алк_ГрафикСмен.Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
		|	алк_ПеремещениеЛесопродукции.ДатаСмены,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход),
		|	алк_ПеремещениеЛесопродукции.Организация,
		|	NULL,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат,
		|	алк_ПеремещениеЛесопродукции.Смена,
		|	алк_ПеремещениеЛесопродукции.СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеЛесопродукции.Участок,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции КАК алк_ПеремещениеЛесопродукции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|		ПО алк_ПеремещениеЛесопродукции.Ссылка = алк_ПеремещениеЛесопродукцииЗапасы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрафикСмен КАК алк_ГрафикСмен
		|		ПО алк_ПеремещениеЛесопродукции.ДатаСмены = алк_ГрафикСмен.ДатаСмены
		|			И алк_ПеремещениеЛесопродукции.Смена = алк_ГрафикСмен.Смена
		|			И алк_ПеремещениеЛесопродукции.Участок = алк_ГрафикСмен.Участок
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|	И НЕ &ТолькоРасход
		|	И (алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код = ""ПБ-00000002""
		|				И &ДатаНачалаУчетаЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаШпона
		|			ИЛИ алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура.Код <> ""ПБ-00000002""
		|				И &ДатаНачалаУчетаПилматЗаполнена
		|				И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата > &ДатаНачалаУчетаПилмат)";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЛесопродукции);
		Запрос.УстановитьПараметр("ТолькоРасход", ТолькоРасход);
		Запрос.УстановитьПараметр("ДатаНачалаУчетаЗаполнена", ЗначениеЗаполнено(Константы.алк_ДатаНачалаУчетаШпона.Получить()));
		Запрос.УстановитьПараметр("ДатаНачалаУчетаПилматЗаполнена", ЗначениеЗаполнено(Константы.алк_ДатаВремяНачалаВводаПоказателейЦЛПДГ.Получить()));
		Запрос.УстановитьПараметр("ДатаНачалаУчетаПилмат", Константы.алк_ДатаВремяНачалаВводаПоказателейЦЛПДГ.Получить());
		Запрос.УстановитьПараметр("ДатаНачалаУчетаШпона", Константы.алк_ДатаНачалаУчетаШпона.Получить());
	
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", РезультатЗапроса);	
		
	КонецПроцедуры
	
	#КонецОбласти 
	
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходнаяНакладная") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасходнаяНакладная", "Расходная накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РасходнаяНакладная"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТребованиеНакладная") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТребованиеНакладная", "Требование накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТребованиеНакладная"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемаПередачи") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПриемаПередачи", "Акт приема-передачи", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "АктПриемаПередачи"));
			
		КонецЕсли;

		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "РасходнаяНакладная" Тогда
				
				СформироватьРасходнуюНакладную(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "ТребованиеНакладная" Тогда
				
				СформироватьТребованиеНакладную(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "АктПриемаПередачи" Тогда
				
				Если ТекущийДокумент.ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПриемкаС_ЦПШ Тогда  				
					СформироватьАктПриемаПередачи(ТабличныйДокумент, ТекущийДокумент);                                         					
				Иначе                                                                                      					
					Сообщить("Акт приема-передачи доступен только для печати документов приемки с ЦПШ.");      
				КонецЕсли;    				
								
			КонецЕсли;

			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "РасходнаяНакладная";
		КомандаПечати.Представление = НСтр("ru = 'Расходная накладная'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "АктПриемаПередачи";
		КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 2;	
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ТребованиеНакладная";
		КомандаПечати.Представление = НСтр("ru = 'Требование-накладная'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 3;	
	КонецПроцедуры
	
	// Процедура формирования Расходной накладной
	//
	Процедура СформироватьРасходнуюНакладную(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ссылка КАК Ссылка,
		|	алк_ПеремещениеЛесопродукцииЗапасы.НомерСтроки,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Количество КАК Количество,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем КАК Объем,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Номер КАК Номер,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента) КАК ВидОперации,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Объем)
		|ПО
		|	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ПеремещениеЛесопродукции.ПФ_MXL_Накладная");
		
		РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСсылка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаСсылка.ДатаДокумента, ВыборкаСсылка.Номер, ВыборкаСсылка.Префикс);
			
			ОбластьМакета.Параметры.ТекстЗаголовка = "Расходная накладная № "
			+ НомерДокумента
			+ " от "
			+ Формат(ВыборкаСсылка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.ВидОперации = ВыборкаСсылка.ВидОперации;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ВыборкаСсылка.Организация, ВыборкаСсылка.ДатаДокумента, ,);
			ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ФактическийАдрес") +
			", " + ВыборкаСсылка.СтруктурнаяЕдиница;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.ПредставлениеПолучателя = "";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ВыборкаЗапасы = ВыборкаСсылка.Выбрать();
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Количество = 0;
			
			Пока ВыборкаЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаЗапасы);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество	= Количество + 1;
				
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСсылка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогиПрописью");
			ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований "
			+ Строка(Количество) + ", общее Количество " + Строка(ВыборкаСсылка.Количество) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Количество) 
			+ "), общий Объем " + Строка(ВыборкаСсылка.Объем) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Объем) + ")";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодписьАкта");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
	КонецПроцедуры // СформироватьРасходнуюНакладную
	
	// Процедура формирования Требования-накладной
	//
	Процедура СформироватьТребованиеНакладную(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ссылка КАК Ссылка,
		|	алк_ПеремещениеЛесопродукцииЗапасы.НомерСтроки,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Количество КАК Количество,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем КАК Объем,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Номер КАК Номер,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента) КАК ВидОперации,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель) КАК СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Объем)
		|ПО
		|	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ПеремещениеЛесопродукции.ПФ_MXL_ТребованиеНакладная");
		
		РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСсылка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаСсылка.ДатаДокумента, ВыборкаСсылка.Номер, ВыборкаСсылка.Префикс);
			
			ОбластьМакета.Параметры.ТекстЗаголовка = "Требование-накладная № "
			+ НомерДокумента
			+ " от "
			+ Формат(ВыборкаСсылка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.ВидОперации = ВыборкаСсылка.ВидОперации;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Отправитель");
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ВыборкаСсылка.Организация, ВыборкаСсылка.ДатаДокумента, ,);
			ОбластьМакета.Параметры.ПредставлениеОтправителя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ФактическийАдрес") +
			", " + ВыборкаСсылка.СтруктурнаяЕдиница;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
			ОбластьМакета.Параметры.ПредставлениеПолучателя = ВыборкаСсылка.СтруктурнаяЕдиницаПолучатель;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ВыборкаЗапасы = ВыборкаСсылка.Выбрать();
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Количество = 0;
			
			Пока ВыборкаЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаЗапасы);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество	= Количество + 1;
				
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСсылка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогиПрописью");
			ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований "
			+ Строка(Количество) + ", общее Количество " + Строка(ВыборкаСсылка.Количество) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Количество) 
			+ "), общий Объем " + Строка(ВыборкаСсылка.Объем) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Объем) + ")";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//ОбластьМакета = Макет.ПолучитьОбласть("ПодписьАкта");
			//
			//ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
	КонецПроцедуры // СформироватьТребованиеНакладную
		
	// Процедура формирования Расходной накладной
	//
	Процедура СформироватьАктПриемаПередачи(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ссылка КАК Ссылка,
		|	алк_ПеремещениеЛесопродукцииЗапасы.НомерСтроки,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Количество КАК Количество,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем КАК Объем,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Номер КАК Номер,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента) КАК ВидОперации,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Объем)
		|ПО
		|	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ПеремещениеЛесопродукции.ПФ_MXL_Накладная");
		
		РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСсылка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаСсылка.ДатаДокумента, ВыборкаСсылка.Номер, ВыборкаСсылка.Префикс);
			
			ОбластьМакета.Параметры.ТекстЗаголовка = "Акт приема-передачи № "
			+ НомерДокумента
			+ " от "
			+ Формат(ВыборкаСсылка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.ВидОперации = ВыборкаСсылка.ВидОперации;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			
			ОбластьМакета.Параметры.ПредставлениеПоставщика = "Участок приемки сырья АЛК шпон";
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.ПредставлениеПолучателя = "Участок приемки сырья АЛК ЛЗ";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ВыборкаЗапасы = ВыборкаСсылка.Выбрать();
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Количество = 0;
			
			Пока ВыборкаЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаЗапасы);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество	= Количество + 1;
				
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСсылка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогиПрописью");
			ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований "
			+ Строка(Количество) + ", общее Количество " + Строка(ВыборкаСсылка.Количество) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Количество) 
			+ "), общий Объем " + Строка(ВыборкаСсылка.Объем) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Объем) + ")";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодписьАкта");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
	КонецПроцедуры // СформироватьРасходнуюНакладную
	
	//Формирует таблицу значений, для отражения оборотов производства Сергеева Г.О.
	Процедура СформироватьТаблицуОборотыПроизводства(ДокументСсылкаПеремещениеЛесопродукции, СтруктураДополнительныеСвойства)
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Объем,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ЯчейкаПолучатель КАК Штабель,
			|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Поступление) КАК Операция,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК Период
			|ИЗ
			|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
			|ГДЕ
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &ДокументСсылкаПеремещениеЛесопродукции
			|	И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПриемкаС_ЦПШ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Объем,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ячейка КАК Штабель,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК Период,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Количество,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ячейка КАК Ячейка,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат
			|ИЗ
			|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
			|ГДЕ
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &ДокументСсылкаПеремещениеЛесопродукции
			|	И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Объем,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ЯчейкаПолучатель,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Количество,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ЯчейкаПолучатель,
			|	алк_ПеремещениеЛесопродукцииЗапасы.Сертификат
			|ИЗ
			|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
			|ГДЕ
			|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &ДокументСсылкаПеремещениеЛесопродукции
			|	И алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ДокументСсылкаПеремещениеЛесопродукции", ДокументСсылкаПеремещениеЛесопродукции);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();   
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[1].Выгрузить());
		
	КонецПроцедуры

	#КонецОбласти
	
	
#КонецЕсли


// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	//Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
КонецПроцедуры
// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	//Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
	//Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов



Процедура Конец()	
КонецПроцедуры
